Table of Contents
 Interface IGrpcMessageHandler<T>
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Handles communication over Grpc.
public interface IGrpcMessageHandler<T> : IGrpcMessageHandler where T : class
Type Parameters
T
Methods
 HandleClientMessage(GrpcMessage, IGrpcSender)
Handles response incoming from the server.
Task<T> HandleClientMessage(GrpcMessage message, IGrpcSender client)
Parameters
message GrpcMessage
Message sent by server.
client IGrpcSender
Returns
Task<T>
 HandleServerMessage(GrpcMessage, IGrpcSender)
Handles request incoming from the client.
Task<T> HandleServerMessage(GrpcMessage message, IGrpcSender server)
Parameters
message GrpcMessage
Message sent by client.
server IGrpcSender
Returns
Task<T>
 Edit this page